head(airquality) #显示数据框的前6行
tail(airquality) #显示数据框的后6

head(airquality, 10) #显示数据框的前10行

summary(airquality) # 显示每一列的最小值，最大值， 25%的分位值, 中值，75%的分位值，均值, 是否有缺失值NA
str(airquality)


table(airquality$Month) #对数据框的指定列进行行数统计
table(airquality$Ozone) #对数据框的指定列进行行数统计, 默认不显示缺失值

table(airquality$Ozone, useNA = "ifany") # 表示将缺失值也显示出来
#   1    4    6    7    8    9   10   11   12   13   14   16   18   19   20   21
#22   23   24   27   28   29 1    1    1    3    1    3    1    3    2    4    4
#4    4    1    4    4    1    6    2    1    3    1 30   31   32   34   35   36
#37   39   40   41   44   45   46   47   48   49   50   52   59   61   63   64 2
#1    3    1    2    2    2    2    1    1    3    2    1    1    1    1    1
#1    2    1    1    2 65   66   71   73   76   77   78   79   80   82   84   85
#89   91   96   97  108  110  115  118  122  135 1    1    1    2    1    1    2
#1    1    1    1    2    1    1    1    2    1    1    1    1    1    1 168
#<NA> 1   37 
