# 介绍 split函数
#split函数 的作用： 对向量/或者其他对象,根据因子/或者因子列表,进行分组
#      参数1: 向量/列表/数据库
#      参数2: 因子/因子列表 

################################################################################
# 例子
# step1
#创建一个向量x,包含15个元素
x <- c(rnorm(5), runif(5), rnorm(5,1)) # 此向量共有5*3个元素， 前五个元素来自正态分布， 中间5个元素来自均匀分布， 最后5个元素来自均值为1标准差为0的正态分布
x
# 运行结果
# [1] -1.12211250  0.74064501 -1.30519368  0.45889132  1.11697569  0.08453611  0.83237125  0.28283783
# [9]  0.02937982  0.92251282  0.22852266  2.56012583  0.10046473 -0.51020850  2.82997222

# step2
#建立一个因子，包含3个水平 每个水平下有5个元素
f <- gl(3,5)
f
# [1] 1 1 1 1 1 1 2 2 2 2 2 2 3 3 3 3 3 3
#Levels: 1 2 3

#[[2]]
#[1] 2 2 2

#[[3]]
#[1] 3 3

#[[4]]
#[1] 4

# setp3
split(x, f, mean) #作用,对向量x按因子f进行分组;返回值类型: 一个列表;
# 运行结果:
#$`1`
#[1] -1.4533108  0.4123653 -0.2102013 -1.4979466 -0.6112404
#
#$`2`
#[1] 0.07761567 0.38260010 0.40394185 0.65398650 0.94987215
#
#$`3`
#[1] 0.9966612 2.2344511 0.4418127 0.7991303 0.3531647

################################################################################
# 通常split会和lapply一起使用
lapply(split(x,f), mean)
# 运行后,返回一个列表
#$`1`
#[1] -0.6720668
#
#$`2`
#[1] 0.4936033
#
#$`3`
#[1] 0.965044
#


################################################################################
# 例子: 展示如何对一个数据框执行split

# step1
       head(airquality) #拿到一个数据框
       # 返回数据框的前6行（airquality用来展示气象数据，她包含6个变量，其中有一个变量表示月份）
       #  Ozone Solar.R Wind Temp Month Day
       #1    41     190  7.4   67     5   1
       #2    36     118  8.0   72     5   2
       #3    12     149 12.6   74     5   3
       #4    18     313 11.5   62     5   4
       #5    NA      NA 14.3   56     5   5
       #6    28      NA 14.9   66     5   6
       
       
       s <- split(airquality, airquality$Month)
       s #返回一个s列表，s列表中的每一个元素是一个数据框; 按月份分组显示每个月的数据
       
            airquality$Month
            #  [1] 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6 6
            # [53] 6 6 6 6 6 6 6 6 6 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 7 8 8 8 8 8 8 8 8 8 8 8 8
            #[105] 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 8 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9 9
            
             class(airquality$Month)
            #[1] "integer"
            
             table(airquality$Month) #统计每个月份下记录了多少条数据
            # 5  6  7  8  9 
            #31 30 31 31 30 

 #step2
       lapply(s, function(x){colMeans(x[, c("Ozone", "Solar.R",  "Wind", "Temp")])}) #返回一个列表,分别给出了5月到9月,臭氧含量，风速和温度的平均值
       #`5`
       #  Ozone  Solar.R     Wind     Temp 
       #     NA       NA 11.62258 65.54839 
       #
       #`6`
       #   Ozone   Solar.R      Wind      Temp 
       #      NA 190.16667  10.26667  79.10000 
       #
       #`7`
       #    Ozone    Solar.R       Wind       Temp 
       #       NA 216.483871   8.941935  83.903226 
       #
       #`8`
       #   Ozone   Solar.R      Wind      Temp 
       #      NA        NA  8.793548 83.967742 
       #
       #`9`
       #  Ozone  Solar.R     Wind     Temp 
       #     NA 167.4333  10.1800  76.9000 
       
 #step3: 美化, 使用sapply将list展示成一个容易观察的展现形式: matrix
       #注意: "统计所有行的指定列" 写作 "[,指定列的列名称]"
       sapply(s, function(x){colMeans(x[, c("Ozone", "Solar.R",  "Wind", "Temp")])}) #返回一个列表,分别给出了5月到9月,臭氧含量，风速和温度的平均值
       #              5         6          7         8        9
       #Ozone         NA        NA         NA        NA       NA
       #Solar.R       NA 190.16667 216.483871        NA 167.4333
       #Wind    11.62258  10.26667   8.941935  8.793548  10.1800
       #Temp    65.54839  79.10000  83.903226 83.967742  76.9000

#step4: 使用参数 na.rm = T 来刨除缺失值， 缺失值影响了结果的计算
       sapply(s, function(x){colMeans(x[, c("Ozone", "Solar.R",  "Wind", "Temp")], na.rm = TRUE)}) #返回一个列表,分别给出了5月到9月,臭氧含量，风速和温度的平均值
       #                5         6          7          8         9
       #Ozone    23.61538  29.44444  59.115385  59.961538  31.44828
       #Solar.R 181.29630 190.16667 216.483871 171.857143 167.43333
       #Wind     11.62258  10.26667   8.941935   8.793548  10.18000
       #Temp     65.54839  79.10000  83.903226  83.967742  76.90000
       #> 
