#apply函数 的作用： 沿着数组的某一个维度来处理数据
# - lapply可以循环处理列表中的每一个元素
# - mapply是lapply的多远版本
#参数1: 列表
#参数2: 函数
#参数3: 其他参数
#返回： 总是返回一个列表
################################################################################
str(lapply) #查看lapply的签名

################################################################################
# 例子1
#创建一个列表
#list(rep(1, 4), rep(2, 3), rep(3, 2), rep(4, 1)) #4个1， 3个2， 2个3,1个4
x <- list(a=1:10, b=c(11,21,31,41,51))
x

lapply(x, mean)
#运行结果:
#> lapply(x, mean)
#$a
#[1] 5.5
#
#$b
#[1] 31

################################################################################
# 例子2
x <- 1:4
lapply(x, runif) #runif的左右是从一个均匀分布的整理里抽取出给定参数作为个数个数出来
#运行结果:
#[[1]]
#[1] 0.3925193
#
#[[2]]
#[1] 0.3925193
#
#[[3]]
#[1] 0.3925193
#
#[[4]]
#[1] 0.3925193
