#lapply函数 的作用： 沿着数组的某一个维度来处理数据
# - lapply可以循环处理列表中的每一个元素
# - mapply是lapply的多远版本
#参数1: 列表
#参数2: 函数
#参数3: 其他参数
#返回： 总是返回一个列表
################################################################################
str(lapply) #查看lapply的签名

################################################################################
# 例子1
#创建一个列表
#list(rep(1, 4), rep(2, 3), rep(3, 2), rep(4, 1)) #4个1， 3个2， 2个3,1个4
x <- list(a=1:10, b=c(11,21,31,41,51))
x

lapply(x, mean)
#运行结果:
#> lapply(x, mean)
#$a
#[1] 5.5
#
#$b
#[1] 31

################################################################################
# 例子2
x <- 1:4 #向量， lapply会将第一个参数强制转换成列表类型
lapply(x, runif) #runif的左右是从一个均匀分布的整理里抽取出给定参数作为个数个数出来(默认取值范围是0到1)
#运行结果:
#[[1]]
#[1] 0.6909489
#
#[[2]]
#[1] 0.2058821 0.9010122
#
#[[3]]
#[1] 0.93965545 0.54826556 0.07346528
#
#[[4]]
#[1] 0.32919752 0.11422698 0.09705096 0.70755731

lapply(x, runif, min = 10, max = 100) #runif的左右是从一个均匀分布的整理里抽取出给定参数作为个数个数出来(取值范围是min到max); min: runif的参数； max: unif的参数;

################################################################################
x <- list(a=matrix(1:6, 2, 3), b=matrix(4:7, 2, 2))
lapply(x, function(m) m[1,]) #函数返回列表中每个矩阵的第一行


################################################################################
# sapply的作用： 将lapply的返回结果简化
# 简化规则：
# 1. 如果返回的列表的每个元素都是1,则返回一个vector
# 2. 如果返回的列表的每个元素都是等于某个大于1的数,则返回一个矩阵
# 3. 其他： 仍返回列表


################################################################################
#例子
 x <- list(a=1:10, b=c(11,21,31,41,51))
 lapply(x, mean)
$a
#[1] 5.5

$b
#[1] 31

 sapply(x, mean)
#   a    b 
# 5.5 31.0 

 class(sapply(x, mean))
#[1] "numeric"



